app/controllers/users_controller.rb

INSERT INTO "users" ("name", "salt", "updated_at", "activated_at", "crypted_password", "remember_token_expires_at", "activation_code", "remember_token", "login", "email", "created_at") VALUES('', '849d568286b2e060f1cd1702c1ca5f7236b4e667', '2009-08-29 17:17:14', NULL, '7d667a067352e2b9db8285ea16d5b77a595f676a', NULL, '6d280d495d4382ba08c32ad233ba58545acbbc91', NULL, 'sarahmei', 'sarahmei@gmail.com', '2009-08-29 17:17:14')
---
  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save